/*==============================================================================*/
/* Run Mode Judgement C File							*/
/*==============================================================================*/

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "run_mode_judgment.h"

/*------------------------------------------------------------------------------*/
/* Global Variable								*/
/*------------------------------------------------------------------------------*/
enum RUN_MODE ge_RunMode = Stop;

/*------------------------------------------------------------------------------*/
/* Function prototype								*/
/*------------------------------------------------------------------------------*/
void vd_Judgment_RunMode(int i_Exists_ForwardWall, int i_Exists_LeftWall, int i_Exists_RightWall, int i_IsGoal); // 走行モード決定
 
/*------------------------------------------------------------------------------*/
/* Function Definitions								*/
/*------------------------------------------------------------------------------*/

/*==============================================================================*/
/*  走行モード決定			                                        */
/* 										*/
/*  進行方向を決定する								*/
/* ---------------------------------------------------------------------------- */
/*  Arguments:		i_Exists_ForwardWall	前壁有無		       	*/
/*  			i_Exists_LeftWall	左壁有無			*/
/*  			i_Exists_RightWall	右壁有無			*/
/*  	         	i_IsGoal		ゴール判定結果			*/
/*  Return   :         	-							*/
/*==============================================================================*/
void vd_Judgment_RunMode(int i_Exists_ForwardWall, int i_Exists_LeftWall, int i_Exists_RightWall, int i_IsGoal)
{
	/* 走行モードの決定 */
	if(i_IsGoal == TRUE)			// ゴールなら
	{	
		ge_RunMode = Stop;	
	}
	else if(i_Exists_LeftWall == FALSE)	// 左に壁が無いなら左旋回
	{	
		ge_RunMode = TurnLeft;
	}
	else if(i_Exists_ForwardWall == FALSE)	// 前に壁が無いなら前進
	{	
		ge_RunMode = Forward;
	}
	else if(i_Exists_RightWall == FALSE)	// 右に壁が無いなら右旋回
	{	
		ge_RunMode = TurnRight;
	}
	else					// 異常系(3方向のいずれにも壁が無い)の場合は停止
	{
		ge_RunMode = Reverse;
	}
}