/* slalom.h */
#ifndef _SLALOM_H
#define _SLALOM_H

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "motor_driver.h"

/*------------------------------------------------------------------------------*/
/* Defines									*/
/*------------------------------------------------------------------------------*/

/* スラローム軌道用パラメータ */
#define OFFSET_SECTION		(10)				// 10[mm] …カーブ前後に入れるオフセット区間(直進)
#define ACTUAL_RADIUS		(90-OFFSET_SECTION)		// 80[mm] …実際に走行する円弧軌道の半径
#define ACTUAL_ARC		(ACTUAL_RADIUS * 2 * PI) / 4	// 約125.7[mm] …実際に走行する円弧の距離

#define INNER_STEP_SLALOM	()
#define OUTER_STEP_SLALOM	()

#endif