/*==============================================================================*/
/* Switch Driver Header File							*/
/*==============================================================================*/
#ifndef _SWITCH_DRIVER_H
#define _SWITCH_DRIVER_H

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "iodefine.h"

/*------------------------------------------------------------------------------*/
/* Defines									*/
/*------------------------------------------------------------------------------*/
/* モード選択スイッチ */
#define SW_R	(PORTC.PIDR.BIT.B2)	// 右スイッチ	(青)
#define SW_C	(PORTC.PIDR.BIT.B3)	// 中央スイッチ	(黄)
#define SW_L	(PORT3.PIDR.BIT.B1)	// 左スイッチ	(赤)

/* スイッチ状態 */
#define SW_OFF		(1)		// スイッチがOFFの時に取る値
#define SW_ON		(0)		// スイッチがONの時に取る値
#define CHATTERING_WAIT	(50)		// チャタリング回避用待ち時間

#endif