/*==============================================================================*/
/* SensorDriver C File								*/
/*==============================================================================*/

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "sensor_driver.h"

/*------------------------------------------------------------------------------*/
/* Global Variable								*/
/*------------------------------------------------------------------------------*/
t_sensor	sen_r;		// 右センサ構造体
t_sensor	sen_l;		// 左センサ構造体
t_sensor	sen_fr;		// 右前センサ構造体
t_sensor	sen_fl;		// 左前センサ構造体
t_control	con_wall;	// 制御構造体

/*------------------------------------------------------------------------------*/
/* Function prototype								*/
/*------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------*/
/* Function Definitions								*/
/*------------------------------------------------------------------------------*/
void vd_InitSensor(void);

/*==============================================================================*/
/* センサーパラメータ初期化		                                        */
/* 										*/
/* ---------------------------------------------------------------------------- */
/*  Arguments:		-						       	*/
/*  Return   :         	-							*/
/*==============================================================================*/
void vd_InitSensor(void)
{	
	sen_r.ref = REF_SEN_R;			// 右センサのリファレンス値を初期化
	sen_l.ref = REF_SEN_L;			// 左センサのリファレンス値を初期化
	
	sen_r.th_wall = TH_SEN_R;		// 右センサの壁有無判断の閾値を初期化
	sen_l.th_wall = TH_SEN_L;		// 左センサの壁有無判断の閾値を初期化
	
	sen_fr.th_wall = TH_SEN_FR;		// 右前センサの壁有無判断の閾値を初期化
	sen_fl.th_wall = TH_SEN_FL;		// 左前センサの壁有無判断の閾値を初期化
	
	sen_r.th_control = CONTH_SEN_R;		// 右センサの壁制御かけるか否かの閾値を初期化
	sen_l.th_control = CONTH_SEN_L;		// 左センサの壁制御かけるか否かの閾値を初期化
	
	con_wall.kp = CON_WALL_KP;		// 壁比例制御の比例定数を初期化
}