/*==============================================================================*/
/* Run Route Judgement Header File						*/
/*==============================================================================*/
#ifndef _RUN_ROUTE_JUDGEMENT_H
#define _RUN_ROUTE_JUDGEMENT_H

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "maze_data.h"
#include "step_map_judgement.h"
#include "tire_control.h"

/*------------------------------------------------------------------------------*/
/* Externs Variable								*/
/*------------------------------------------------------------------------------*/
extern unsigned int run_route[MAZESIZE_X * MAZESIZE_Y];		// 走行経路記録用配列 最大：6×6

/*------------------------------------------------------------------------------*/
/* Function prototype								*/
/*------------------------------------------------------------------------------*/
void create_run_route(void);					// 走行経路作成

/* サブ関数 */
void init_run_route(void);					// 走行経路情報初期化
int judgement_next_run_mode(int next_direction, int my_dir);	// 走行モード判定
int get_next_direction(int my_pos_x, int my_pos_y, int my_dir);	// 進行方向取得
int get_priority(int my_dir, int next_dir);			// 行先優先度算出

/*------------------------------------------------------------------------------*/
/* Enum Definitions								*/
/*------------------------------------------------------------------------------*/
/* 自車位置の向き(方角)を示す値 */
enum DIRECTION
{
	NORTH = 0,	// 北
	EAST  = 1,	// 東
	SOUTH = 2,	// 南
	WEST  = 3	// 西
};

/*------------------------------------------------------------------------------*/
/* Defines									*/
/*------------------------------------------------------------------------------*/
#define INVALID_VALUE	(255)	// 無効値

#endif